app/Controllers/Admin.php

    public function master_barang()
    {
        $data['title'] = 'Master Barang';

        $data['master_brg'] = $this->masterBarangModel
            ->select('master_barang.*')
            ->orderBy('jenis_brg', 'ASC')
            ->findAll();
---
SELECT *
FROM `master_barang`
ORDER BY `jenis_brg` ASC

    public function addBarang()
    {
        $data = [
            'title'           => 'Tambah Barang',
            'validation'      => $this->validation,
            'satuan'          => $this->satuanModel->findAll(),
            'kategori_barang' => $this->KategoriBarangModel->findAll(),
        ];
---
SELECT *
FROM `kategori_barang`
SELECT *
FROM `satuan`
SELECT *
FROM `merk_barang`

    public function getMerkByKategori($kategori_id)
    {
        $merk = $this->MerkKategoriBarangModel
            ->select('merk_barang.id, merk_barang.nama_merk')
            ->join('merk_barang', 'merk_kategori_barang.merk_id = merk_barang.id')
            ->where('merk_kategori_barang.kategori_id', $kategori_id)
            ->findAll();
---
SELECT `merk_barang`.`id`, `merk_barang`.`nama_merk`
FROM `merk_kategori_barang`
JOIN `merk_barang` ON `merk_kategori_barang`.`merk_id` = `merk_barang`.`id`
WHERE `merk_kategori_barang`.`kategori_id` = '1'

        ];

        // Insert ke master_barang
        $this->masterBarangModel->insert($data);
---
INSERT INTO `master_barang` (`kode_brg`, `nama_brg`, `kategori_id`, `merk_id`, `jenis_brg`, `spesifikasi`, `id_satuan`, `is_active`, `created_at`, `updated_at`) VALUES ('CEK-20250908-435', 'Cek', '2', '2', 'hrd', 'aa', 2, 1, '2025-09-08 01:19:21', '2025-09-08 01:19:21')

                'ruangan_id_lama'    => null, // Atau isi ID ruangan lama kalau ada
                'keterangan'         => 'Barang HRD baru, pengecekan awal',
            ];
            $this->pengecekanModel->insert($dataPengecekan);
---
INSERT INTO `pengecekan` (`id_inventaris`, `tanggal_pengecekan`, `ruangan_id_lama`, `keterangan`) VALUES ('CEK-20250908-435', '2025-09-08', NULL, 'Barang HRD baru, pengecekan awal')

    public function adm_inventaris()
    {
        // 1. Ambil data flat: per kode_barang + ruangan, stok langsung dari field
        $rekap = $this->InventarisModel
            ->select('
            master_barang.kode_brg,
            master_barang.nama_brg,
            master_barang.merk,
            master_barang.tipe_serie,
            master_barang.jenis_brg,
            ruangan.nama_ruangan,
            inventaris.stok
        ')
            ->join('master_barang', 'master_barang.kode_brg = inventaris.id_master_barang')
            ->join('ruangan', 'ruangan.id = inventaris.ruangan_id', 'left')
            ->where('master_barang.is_active', 1)
            ->orderBy('master_barang.kode_brg, ruangan.nama_ruangan')
            ->findAll();
---
SELECT `master_barang`.`kode_brg`, `master_barang`.`nama_brg`, `master_barang`.`merk`, `master_barang`.`tipe_serie`, `master_barang`.`jenis_brg`, `ruangan`.`nama_ruangan`, `inventaris`.`stok`
FROM `inventaris`
JOIN `master_barang` ON `master_barang`.`kode_brg` = `inventaris`.`id_master_barang`
LEFT JOIN `ruangan` ON `ruangan`.`id` = `inventaris`.`ruangan_id`
WHERE `master_barang`.`is_active` = 1
ORDER BY `master_barang`.`kode_brg`, `ruangan`.`nama_ruangan`

    public function peminjaman()
    {
        $status = $this->request->getGet('status') ?? 'all'; // ambil dari query param

        $builder = $this->PeminjamanHeaderModel
            ->select('peminjaman_header.*, users.username as peminjam, r.nama_ruangan as lokasi_pinjam')
            ->join('users', 'users.id = peminjaman_header.id_user', 'left')
            ->join('ruangan r', 'r.id = peminjaman_header.ruangan_id_pinjam', 'left')
            ->orderBy('peminjaman_header.tanggal_permintaan', 'desc');

        if ($status && $status != 'all') {
            $builder->where('peminjaman_header.status', $status);
        }

        $peminjamans = $builder->findAll();
---
SELECT *
FROM `users`
SELECT `peminjaman_header`.*, `users`.`username` as `peminjam`, `r`.`nama_ruangan` as `lokasi_pinjam`
FROM `peminjaman_header`
LEFT JOIN `users` ON `users`.`id` = `peminjaman_header`.`id_user`
LEFT JOIN `ruangan` `r` ON `r`.`id` = `peminjaman_header`.`ruangan_id_pinjam`
WHERE `peminjaman_header`.`status` = 'diproses'
ORDER BY `peminjaman_header`.`tanggal_permintaan` DESC

    public function tambahPeminjaman()
    {
        $status  = $this->request->getGet('status') ?? 'all';
        $users   = $this->Profil->findAll();
        $barangs = $this->InventarisModel
            ->join('master_barang', 'master_barang.kode_brg = inventaris.id_master_barang', 'left')
            ->where('inventaris.stok >', 0)
            ->findAll();

        $ruangan    = $this->RuanganModel->findAll();
---
SELECT *
FROM `inventaris`
LEFT JOIN `master_barang` ON `master_barang`.`kode_brg` = `inventaris`.`id_master_barang`
WHERE `inventaris`.`stok` > 0
SELECT *
FROM `ruangan`

    public function detailPeminjaman($id)
    {
        $db = db_connect();

        // --- Ambil data header ---
        $header = $db->table('peminjaman_header')
            ->select('peminjaman_header.*, u.username, u.fullname, r1.nama_ruangan as ruangan_pinjam, r2.nama_ruangan as ruangan_sebelum')
            ->join('users u', 'u.id = peminjaman_header.id_user', 'left')
            ->join('ruangan r1', 'r1.id = peminjaman_header.ruangan_id_pinjam', 'left')
            ->join('ruangan r2', 'r2.id = peminjaman_header.ruangan_id_sebelum', 'left')
            ->where('peminjaman_header.peminjaman_id', $id)
            ->get()
            ->getRowArray();

        if (! $header) {
            return redirect()->back()->with('error', 'Data peminjaman tidak ditemukan!');
        }

        // --- Ambil data detail barang yang dipinjam ---
        $details = $db->table('peminjaman_detail')
            ->select('peminjaman_detail.*, i.kode_barang, i.kondisi, i.spesifikasi, m.nama_brg, m.merk, r.nama_ruangan')
            ->join('inventaris i', 'i.kode_barang = peminjaman_detail.inventaris_id', 'left')
            ->join('master_barang m', 'm.kode_brg = i.id_master_barang', 'left')
            ->join('ruangan r', 'r.id = peminjaman_detail.ruangan_id', 'left')
            ->where('peminjaman_detail.peminjaman_id', $id)
            ->get()
            ->getResultArray();
---
SELECT `peminjaman_header`.*, `u`.`username`, `u`.`fullname`, `r1`.`nama_ruangan` as `ruangan_pinjam`, `r2`.`nama_ruangan` as `ruangan_sebelum`
FROM `peminjaman_header`
LEFT JOIN `users` `u` ON `u`.`id` = `peminjaman_header`.`id_user`
LEFT JOIN `ruangan` `r1` ON `r1`.`id` = `peminjaman_header`.`ruangan_id_pinjam`
LEFT JOIN `ruangan` `r2` ON `r2`.`id` = `peminjaman_header`.`ruangan_id_sebelum`
WHERE `peminjaman_header`.`peminjaman_id` = '1'
SELECT `peminjaman_detail`.*, `i`.`kode_barang`, `i`.`kondisi`, `i`.`spesifikasi`, `m`.`nama_brg`, `m`.`merk`, `r`.`nama_ruangan`
FROM `peminjaman_detail`
LEFT JOIN `inventaris` `i` ON `i`.`kode_barang` = `peminjaman_detail`.`inventaris_id`
LEFT JOIN `master_barang` `m` ON `m`.`kode_brg` = `i`.`id_master_barang`
LEFT JOIN `ruangan` `r` ON `r`.`id` = `peminjaman_detail`.`ruangan_id`
WHERE `peminjaman_detail`.`peminjaman_id` = '1'

        $mutasi = [];
        if (! empty($details)) {
            $inventarisIds = array_column($details, 'inventaris_id');
            $mutasi        = $db->table('transaksi_barang')
                ->whereIn('kode_barang', $inventarisIds)
                ->where('jenis_transaksi', 'KEMBALI')
                ->orderBy('tanggal_transaksi', 'desc')
                ->get()
                ->getResultArray();
---
SELECT *
FROM `transaksi_barang`
WHERE `kode_barang` IN ('1')
AND `jenis_transaksi` = 'KEMBALI'
ORDER BY `tanggal_transaksi` DESC

    public function kategoriMerk_edit($id)
    {
        $relasi = $this->MerkKategoriBarangModel->find($id);
        if (! $relasi) {
            return redirect()->to('/Admin/KategoriMerk')->with('PesanGagal', 'Data relasi tidak ditemukan.');
        }

        $data = [
            'title'    => 'Edit Relasi Kategori - Merk',
            'relasi'   => $relasi,
            'kategori' => $this->KategoriBarangModel->findAll(),
            'merk'     => $this->MerkBarangModel->findAll(),
        ];
---
SELECT *
FROM `merk_barang`

    public function detailpinjam($id)
    {
        $barangList = $this->BarangModel->findAll();
---
SELECT *
FROM `merk_barang`