app/Controllers/Admin.php

SELECT `peminjaman_header`.*, `users`.`username` as `peminjam`
FROM `peminjaman_header`
LEFT JOIN `users` ON `users`.`id` = `peminjaman_header`.`id_user`
ORDER BY `peminjaman_header`.`tanggal_permintaan` DESC
---
    public function peminjaman()
    {
        $status = $this->request->getGet('status') ?? 'all'; // ambil dari query param

        $builder = $this->PeminjamanHeaderModel
            ->select('peminjaman_header.*, users.username as peminjam')
            ->join('users', 'users.id = peminjaman_header.id_user', 'left')
            ->orderBy('peminjaman_header.tanggal_permintaan', 'desc');

SELECT *
FROM `kategori_barang`
---
public function tambahMerkKategori()
{
    $data = [
        'title'    => 'Tambah Merk pada Kategori',
        'kategori' => $this->KategoriBarangModel->findAll(),