app/Controllers/User.php

SELECT *
FROM `auth_groups_users`
WHERE `user_id` = '23'
SELECT *
FROM `peminjaman_header`
WHERE `id_user` = '23'
SELECT `id`, `username`, `email`, `created_at`, `foto`
FROM `users`
WHERE `username` = 'ganda'
---
    public function tentang()
    {

        $userlogin = user()->username;
        $userid = user()->id;
        $role = $this->db->table('auth_groups_users')->where('user_id', $userid)->get()->getRow();
        $role == '1' ? $role_echo = 'user' : $role_echo = 'User';



        $data = $this->db->table('peminjaman_header');
        $query1 = $data->where('id_user', $userid)->get()->getResult();
        $builder = $this->db->table('users');
        $builder->select('id,username,email,created_at,foto');
        $builder->where('username', $userlogin);
        $query = $builder->get();

SELECT *
FROM `users`
SELECT `peminjaman_header`.*, `users`.`username` as `peminjam`, `users`.`fullname` as `nama_lengkap`, `r`.`nama_ruangan` as `lokasi_pinjam`
FROM `peminjaman_header`
LEFT JOIN `users` ON `users`.`id` = `peminjaman_header`.`id_user`
LEFT JOIN `ruangan` `r` ON `r`.`id` = `peminjaman_header`.`ruangan_id_pinjam`
WHERE `peminjaman_header`.`id_user` = '24'
ORDER BY `peminjaman_header`.`tanggal_pinjam` DESC
---
    public function peminjaman()
    {
        $status = $this->request->getGet('status') ?? 'all'; // ambil dari query param

        $builder = $this->PeminjamanHeaderModel
            ->select('peminjaman_header.*, users.username as peminjam, users.fullname as nama_lengkap, r.nama_ruangan as lokasi_pinjam')
            ->join('users', 'users.id = peminjaman_header.id_user', 'left')
            ->join('ruangan r', 'r.id = peminjaman_header.ruangan_id_pinjam', 'left')
            ->orderBy('peminjaman_header.tanggal_pinjam', 'desc')
            ->where('peminjaman_header.id_user', user()->id);


        if ($status && $status != 'all') {
            $builder->where('peminjaman_header.status', $status);
        }

        $peminjamans = $builder->findAll();

SELECT *
FROM `inventaris`
LEFT JOIN `master_barang` ON `master_barang`.`kode_brg` = `inventaris`.`id_master_barang`
WHERE `inventaris`.`stok` > 0
SELECT *
FROM `ruangan`
---
    public function tambahPeminjaman()
    {
        $status  = $this->request->getGet('status') ?? 'all';
        $users   = $this->Profil->findAll();
        $barangs = $this->InventarisModel
            ->join('master_barang', 'master_barang.kode_brg = inventaris.id_master_barang', 'left')
            ->where('inventaris.stok >', 0)
            ->findAll();

        $ruangan    = $this->RuanganModel->findAll();

SELECT *
FROM `auth_groups_users`
WHERE `user_id` = '23'
SELECT `peminjaman_header`.*, `u`.`username`, `u`.`fullname`, `r1`.`nama_ruangan` as `ruangan_pinjam`, `r2`.`nama_ruangan` as `ruangan_sebelum`
FROM `peminjaman_header`
LEFT JOIN `users` `u` ON `u`.`id` = `peminjaman_header`.`id_user`
LEFT JOIN `ruangan` `r1` ON `r1`.`id` = `peminjaman_header`.`ruangan_id_pinjam`
LEFT JOIN `ruangan` `r2` ON `r2`.`id` = `peminjaman_header`.`ruangan_id_sebelum`
WHERE `peminjaman_header`.`peminjaman_id` = '5'
SELECT `peminjaman_detail`.*, `i`.*, `m`.*, `r`.*
FROM `peminjaman_detail`
LEFT JOIN `inventaris` `i` ON `i`.`id` = `peminjaman_detail`.`inventaris_id`
LEFT JOIN `master_barang` `m` ON `m`.`kode_brg` = `i`.`id_master_barang`
LEFT JOIN `ruangan` `r` ON `r`.`id` = `peminjaman_detail`.`ruangan_id`
WHERE `peminjaman_detail`.`peminjaman_id` = '5'
---
    public function detailPeminjaman($id)
    {
        $db = db_connect();

        $userid = user()->id;
        $role = $this->db->table('auth_groups_users')->where('user_id', $userid)->get()->getRow();
        $role == '1' ? $role_echo = 'user' : $role_echo = 'User';
        // --- Ambil data header ---
        $header = $db->table('peminjaman_header')
            ->select('peminjaman_header.*, u.username, u.fullname, r1.nama_ruangan as ruangan_pinjam, r2.nama_ruangan as ruangan_sebelum')
            ->join('users u', 'u.id = peminjaman_header.id_user', 'left')
            ->join('ruangan r1', 'r1.id = peminjaman_header.ruangan_id_pinjam', 'left')
            ->join('ruangan r2', 'r2.id = peminjaman_header.ruangan_id_sebelum', 'left')
            ->where('peminjaman_header.peminjaman_id', $id)
            ->get()
            ->getRowArray();

        if (! $header) {
            return redirect()->back()->with('error', 'Data peminjaman tidak ditemukan!');
        }

        // --- Ambil data detail barang yang dipinjam ---
        $details = $db->table('peminjaman_detail')
            ->select('peminjaman_detail.*, i.*, m.*, r.*')
            ->join('inventaris i', 'i.id = peminjaman_detail.inventaris_id', 'left')
            ->join('master_barang m', 'm.kode_brg = i.id_master_barang', 'left')
            ->join('ruangan r', 'r.id = peminjaman_detail.ruangan_id', 'left')
            ->where('peminjaman_detail.peminjaman_id', $id)
            ->get()
            ->getResultArray();

SELECT *
FROM `transaksi_barang`
WHERE `kode_barang` IN ('1')
AND `jenis_transaksi` = 'KEMBALI'
ORDER BY `tanggal_transaksi` DESC
---
        $mutasi = [];
        if (! empty($details)) {
            $inventarisIds = array_column($details, 'inventaris_id');
            $mutasi        = $db->table('transaksi_barang')
                ->whereIn('kode_barang', $inventarisIds)
                ->where('jenis_transaksi', 'KEMBALI')
                ->orderBy('tanggal_transaksi', 'desc')
                ->get()
                ->getResultArray();