app/Models/masterBarangModel.php

    public function getMasterBarang($id = false)
    {
        $builder = $this->select('
            master_barang.*,
            satuan.nama_satuan,
            kategori_barang.nama_kategori
        ')
            ->join('satuan', 'satuan.satuan_id = master_barang.id_satuan', 'left')
            ->join('kategori_barang', 'kategori_barang.id = master_barang.kategori_id', 'left')
            ->orderBy('master_barang.jenis_brg', 'ASC');

        if ($id === false) {
            return $builder->findAll();
---
SELECT `master_barang`.*, `satuan`.`nama_satuan`, `kategori_barang`.`nama_kategori`, `merk_barang`.`nama_merk`
FROM `master_barang`
LEFT JOIN `satuan` ON `satuan`.`satuan_id` = `master_barang`.`id_satuan`
LEFT JOIN `kategori_barang` ON `kategori_barang`.`id` = `master_barang`.`kategori_id`
LEFT JOIN `merk_barang` ON `merk_barang`.`id` = `master_barang`.`merk_id`
ORDER BY `master_barang`.`jenis_brg` ASC