app/Models/MerkKategoriBarangModel.php

SELECT `merk_kategori_barang`.*, `kategori_barang`.`nama_kategori`, `merk_barang`.`nama_merk`
FROM `merk_kategori_barang`
LEFT JOIN `kategori_barang` ON `kategori_barang`.`id` = `merk_kategori_barang`.`kategori_id`
LEFT JOIN `merk_barang` ON `merk_barang`.`id` = `merk_kategori_barang`.`merk_id`
ORDER BY `kategori_barang`.`nama_kategori` ASC
---
    public function fetchAll()
    {
        return $this
            ->select('merk_kategori_barang.*, kategori_barang.nama_kategori, merk_barang.nama_merk')
            ->join('kategori_barang', 'kategori_barang.id = merk_kategori_barang.kategori_id', 'left')
            ->join('merk_barang', 'merk_barang.id = merk_kategori_barang.merk_id', 'left')
            ->orderBy('kategori_barang.nama_kategori', 'ASC')
            ->findAll();